Repository: adham-turki/dashboardflutter
Catalog: lib/l10n/app_*.arb
Languages: ar

source: English
ar: الإنجليزية

source: Arabic
ar: العربية

# dropLangEN
source: English
ar: الانجليزية

# dropLangAR
source: Arabic
ar: العربية

source: SIGN IN
ar: تسجيل الدخول

source: Enter username
ar: ادخل اسم المستخدم

source: Username
ar: اسم المستخدم

# enterPassword
source: Enter paswword
ar: ادخل كلمة المرور

source: Password
ar: كلمة المرور

# wrongInput
source: Wrong Information
ar: معلومات خاطئة

# wronUserNameOrPass
source: Entered Username or Password is incorrect please check it
ar: اسم المستخدم المدخل أو كلمة المرور غير صحيحة

source: Remember Me
ar: تذكرني

source: Login
ar: دخول

source: Sales Adminstration
ar: إدارة المبيعات

source: Sales By Branches
ar: مبيعات الفروع

source: Branches Sales By Categories
ar: مبيعات الفرع حسب التصنيف

source: Daily Sales
ar: المبيعات اليومية

source: Total Collections
ar: إجمالي التحصيلات

source: Final Total
ar: المجموع النهائي

source: Financial Performance
ar: الأداء المالي

source: Cash Flows
ar: التدفقات النقدية

source: Expenses
ar: المصاريف

source: Inventory Performance
ar: أداء المخزون

source: Receivable Management
ar: إدارة الذمم

source: Monthly Comparsion OF Receivable And Payables
ar: مقارنة شهرية للذمم المدينة والدائنة

source: Aging Receivable
ar: تعمير الذمم المدينة

source: Cheques Management
ar: إدارة الشيكات

# chequesAndBank
source: Cheques & Bank
ar: الشيكات والبنوك

source: Cheques
ar: الشيكات

source: Out Standing Cheques
ar: جدول الشيكات الصادرة

source: Reports
ar: التقارير

source: Total Sales
ar: إجمالي المبيعات

source: Sales Report
ar: تقرير المبيعات

source: Purchases Report
ar: تقرير المشتريات

source: Settings
ar: الإعدادت

source: Setup
ar: إعدادات الحساب

source: Change Password
ar: تغيير كلمة المرور

source: Logout
ar: تسجيل الخروج

source: Welcome
ar: مرحبا

source: Period
ar: الفترة

source: Periods
ar: الفترات

source: Chart Type
ar: نوع الرسم البياني

source: Daily
ar: اليوم

source: Weekly
ar: أسبوعي

source: Monthly
ar: شهري

source: Yearly
ar: سنوي

source: Line Chart
ar: رسم خطي

source: Pie Chart
ar: رسم دائري

source: Bar Chart
ar: رسم عمودي

source: From Date
ar: من تاريخ

source: To Date
ar: إلى تاريخ

source: Search
ar: بحث

source: Balances
ar: الأرصدة

source: Branch
ar: الفرع

source: Base Currency
ar: العملة الرئيسية

source: Select
ar: حدد

source: Status
ar: الحالة

source: By Category
ar: حسب التصنيف

source: Accounts
ar: الحسابات

source: Transaction Balance
ar: رصيد الحركات

source: Items Number
ar: عدد الأصناف

source: Top Of Inventory Performance
ar: أكثر الأصناف مبيعاً

source: Least Of Inventory Performance
ar: أقل الأصناف مبيعاً

source: Code
ar: الكود

source: Name
ar: الاسم

source: Current Qty
ar: رصيد الصنف

source: Sold Qnty
ar: الكمية المباعة

source: Cheques Payable
ar: مبالغ الشيكات

source: Bank Settlement
ar: تسوية البنك

# uncollectableCheques
source: Unclollectable Cheques
ar: مجموع الشيكات الواردة - صندوق الشيكات

source: Under Collection Cheques
ar: مجموع الشيكات الواردة - برسم التحصيل (المودعة)

source: Actual Bank Balance
ar: رصيد البنك الفعلي

source: Due Outstanding Cheques
ar: مجموع الشيكات الصادرة المستحقة

source: Due Instanding Cheques
ar: مجموع الشيكات الواردة المستحقة

source: Final Balance
ar: الرصيد الهائي

source: Due Date
ar: تاريخ الاستحقاق

source: From Due Date
ar: من تاريخ الاستحقاق

source: To Due Date
ar: غلى تاريخ الاستحقاق

source: Bank Name
ar: اسم البنك

# supp
source: supplier
ar: المورد

# supplier
source: Supplier {supNum}
ar: المورد {supNum}

source: Currency
ar: العملة

source: Cheque No.
ar: رقم الشيك

source: Cheque Amount
ar: قيمة الشيك

source: Return Qty
ar: كمية المرتجعات

source: Sales Qty
ar: كمية المبيعات

source: Net Sales Amount
ar: صافي المبيعات

source: Net SalesQty
ar: صافي الكمية المباعة

source: Return Amount
ar: قيمة المرتجعات

source: Sales Amount
ar: قيمة المبيعات

# stockCategoryLevel
source: Stock Category Level {num}
ar: مجموع بضاعة مستوى {num}

source: Customer
ar: الزبون

source: Stock
ar: الصنف

source: Stock Code
ar: كود الصنف

source: Stock Barcode
ar: باركود الصنف

source: Customer Category
ar: تصنيف الزبون

source: Campaign No.
ar: رقم الحملة

source: Customer No.
ar: رقم الزبون

source: Multiple
ar: متعدد

source: Reset
ar: إعادة تعيين

source: Export To Excel
ar: تصدير إلى اكسل

source: Model No.
ar: رقم الموديل

source: Average Price
ar: متوسط السعر

source: Total
ar: الإجمالي

# cachBoxAccounts
source: CashBox Accounts
ar: الحسابات النقدية

source: Expenses Accounts
ar: حسابات المصاريف

source: Add
ar: إضافة

source: Add Account
ar: إضافة حساب

source: Account Code
ar: كود الحساب

source: Account Name
ar: اسم الحساب

source: Delete
ar: حذف

source: Receivable Accounts
ar: حسابات الذمم المدينة

source: Payable Accounts
ar: حسابات الذمم الدائنة

source: Bank Accounts
ar: حسابات البنك

source: Old Password
ar: كلمة المرور القديمة

# newPasssword
source: New Password
ar: كلمة المرور الجديدة

source: Criteria
ar: المعايير

source: Order By
ar: الترتيب حسب

# setUPSetting
source: Setup
ar: الإعدادت

source: All
ar: الكل

source: Posted
ar: مرحل

source: Draft
ar: مسودة

source: Canceled
ar: ملغى

source: Brands
ar: العلامات التجارية

source: Brand
ar: العلامة التجارية

source: Invoice
ar: الفاتورة

# categories
source: Categories {catNum}
ar: أصناف البضاعة {catNum}

source: Classifications
ar: التصنيفات

source: CashBox
ar: صندوق النقد

# receivableAndPayableAccounts
source: Receivables and Payables Accounts
ar: حسابات الذمم المدينة والدائنة

# qty
source: Quantity
ar: الكمية

source: Total Collections By Payment Method
ar: إجمالي التحصيلات حسب طريقة الدفع

source: Collections
ar: التحصيل

source: From
ar: من

source: To
ar: إلى

source: Supplier Category
ar: تصنيف المورد

# lessThan30Days
source: Less than 30 day
ar: أقل من 30 يوم

# lessThan60Days
source: Less than 60 day
ar: أقل من 60 يوم

# lessThan90Days
source: Less than 90 day
ar: أقل من 90 يوم

# moreThan90Days
source: More than 90 day
ar: أكثر من 90 يوم

source: Select All
ar: اختيار الكل

source: View
ar: عرض

source: Transaction Type
ar: نوع الحركة

source: BarCode
ar: الباركود

source: Sales
ar: المبيعات

source: Return Sales
ar: مردود المبيعات

source: Appear Basic Unit Equivalence
ar: إظهار مكافىء الوحدة الأساسية

source: Appear Inactive Stocks ForPurchase
ar: إظهار الأصناف غير النشطة للشراء

# appearBasicUnitEquivalenceMobile
source: Appear Basic Unit Equivalence
ar: إظهار مكافىء الوحدة الأساسية

# appearInactiveStocksForPurchaseMobile
source: Appear Inactive Stocks For Purchase
ar: إظهار الأصناف غير النشطة للشراء

source: Rounding Quntity
ar: تقريب الكميات

source: Tax Include
ar: شامل الضريبة

source: Appear Inactive Stocks
ar: إظهار الأصناف غير النشطة

# appearInactiveStocksMobile
source: Appear Inactive Stocks
ar: إظهار الأصناف غير النشطة

source: Appear Location
ar: إظهار المواقع

source: Rounding Price
ar: تقريب المبالغ

source: Appear Discount
ar: إظهار الخصم

source: Use Item Cost Price
ar: استخدام سعر تكلفة الصنف

source: Date
ar: التاريخ

source: Time
ar: الوقت

source: Are you sure?
ar: هل انت متاكد؟

source: User
ar: مستخدم

source: Ok
ar: موافق

source: Cancel
ar: إلغاء

# wrongAliasName
source: Wrong Customer Alias Name!
ar: اسم شركة الزبون خاطئ!

# aliasName
source: Customer Alias Name
ar: اسم شركة الزبون

source: Deleted Succesfully
ar: تم الحذف بنجاح

# aliasReqField
source: Customer Alias name is required
ar: اسم شركة الزبون مطلوب

# nameReqField
source: Username is required
ar: اسم المستخدم مطلوب

# passReqField
source: Password is required
ar: كلمة المرور مطلوبة

source: Cash In
ar: حركة النقد الداخلة

source: Cash Out
ar: حركة النقد الخارجة

source: General
ar: عام

# changeSuccessfully
source: Password Changed Succesfully
ar: تم تغيير كلمة المرور بنجاح

source: Dashboard
ar: الصفحة الرئيسية

source: Show Details
ar: اظهار التفاصيل

# error400
source: There is something wrong
ar: هناك خطأ ما

# error401
source: Unauthorized
ar: غير مصرح به

# error405
source: This transaction cannot be completed due to an incorrect request
ar: لا يمكن إتمام هذه العملية بسبب طلب غير صحيح

# error500
source: The process could not be completed due to a server error
ar: تعذر إتمام العملية بسبب خطأ في الخادم

# error406
source: No Data Available
ar: لا تتوفر بيانات

# error204
source: No User Found
ar: لم يتم العثور على مستخدم

# error404
source: Not Found
ar: غير موجود

# error200
source: Changes updated Successfully
ar: تم تحديث التغييرات بنجاح

# error417
source: Session Expired
ar: انتهت الجلسة

# networkError
source: There is an Network Error!
ar: هناك خلل في الانترنت!

source: Submit
ar: تأكيد

# newPassswordIsReq
source: New Password Field is Required!
ar: حقل كلمة المرور القديمة فارغ!

# oldPassswordIsReq
source: Old Password Field is Required!
ar: حقل كلمة المرور الجديدة فارغ!

# dateFieldsRequired
source: Date Field is Required, It has been restored to today's date.
ar: حقول التاريخ مطلوبة, تمت اعادته الى تاريخ اليوم!

source: Cash
ar: كاش

source: Choose Date
ar: اختر التاريخ

# numOfCustomers
source: Number Of Customers
ar: عدد الزبائن

# totalReturnSal
source: Total Return Sales
ar: إجمالي الفواتير المردودة

# startDateAfterEndDate
source: End Date should be after Start Date
ar: تاريخ النهاية يجب أن يكون بعد تاريخ البداية

source: Date Conflict
ar: تعارض التاريخ

source: Filter
ar: تأكيد

source: Daily Sales Count
ar: حسابات المبيعات اليومية

# checkDates
source: Check Date Format
ar: تحقق من التاريخ!

source: Users
ar: المستخدمين

source: Role
ar: دور

source: Add User
ar: اضافة مستخدم

# allFieldsAreReq
source: All Fields Are Required!
ar: كل الحقول مطلوبة!

# addedSuccess
source: Added Successfully!
ar: تمت الاضافة بنجاح!

source: Edit User
ar: تعديل المستخدم

source: Edit
ar: تعديل

# editedSuccess
source: Edited Successfully!
ar: تم التعديل بنجاح!

# userPermit
source: User Permissions
ar: صلاحيات المستخدم

source: Report Code
ar: كود التقرير

# reportNamee
source: Report Name English
ar: اسم التقرير بالانجليزية

# reportNamea
source: Report Name Arabic
ar: اسم التقرير بالعربية

source: Allowed
ar: مسموح به

source: Not Allowed
ar: غير مسموح به

source: Voucher
ar: السند

# voucherNum
source: Voucher#
ar: السند رقم

source: Account
ar: الحساب

source: Reference
ar: المرجع

source: Debit
ar: مدين

source: Credit
ar: دائن

# dibc
source: Debit in base Currency
ar: مدين بالعملة الرئيسية

# cibc
source: Credit in base Currency
ar: دائن بالعملة الرئيسية

source: Comments
ar: ملاحظات

source: Journal Reports
ar: تقرير دفتر اليومية

source: No Data Available!
ar: لا يوجد معلومات!

source: Excel Exported
ar: تم تصدير الاكسل!

source: From Account
ar: من حساب

source: To Account
ar: الى حساب

source: From Code
ar: من كود

source: To Code
ar: الى كود

source: Voucher Type
ar: نوع السند

# addtoFav
source: Add To Favorite
ar: اضافة الى المفضلة

source: Choose Columns
ar: اختر الأعمدة

# costPriceAvg
source: Cost Price Averge
ar: معدل سعر التكلفة

source: Total Cost
ar: مجموع التكلفة

# diffBetCostAndSale
source: Difference between Cost and Sale
ar: الفرق بين التكلفة والبيع

# profitPercent
source: Profit Percentage %
ar: نسبة الربح %

# startTimeAfterEndTime
source: End Time should be after Start Time
ar: وقت النهاية يجب أن يكون بعد وقت البداية

source: Time Conflict
ar: تعارض الوقت

# validMonth
source: Please enter a valid month
ar: الرجاء إدخال شهر صالح

# validDate
source: Please enter a valid date
ar: الرجاء إدخال تاريخ صالح

source: Item Name
ar: اسم الصنف

source: Critiria and order by
ar: المعايير والترتيب حسب

# showFilters
source: Show filter
ar: إظهار الفلاتر

source: Hide Filters
ar: إخفاء الفلاتر

source: Choose filter
ar: اختيار الفلاتر

source: Contains
ar: يحتوي

# expiredSessionLoginDialog
source: Your session has expired.please log in again
ar: انتهت صلاحية الجلسة، يرجى تسجيل الدخول مجدداً

source: Business Intelligence System
ar: نظام ذكاء الأعمال

source: Sales Reports
ar: تقارير المبيعات

source: Sales By Cashier
ar: المبيعات حسب الكاشير

source: Sales By Computer
ar: المبيعات حسب اسم الجهاز

source: Sales By Payment Types
ar: المبيعات حسب أنواع الدفع

source: Sales By Hours
ar: المبيعات حسب الساعات

# selectBranch
source: Salect Branch
ar: اختر فرع

# selectShiftType
source: Salect Shift Type
ar: اختر نوع الشفت

source: Sales Reports Search
ar: بحث تقارير المبيعات

source: Opened
ar: مفتوح

source: Closed
ar: مغلق

source: Cashier Logs
ar: تجاوزات الكاشير

# selectTransType
source: Select Transaction Type
ar: اختر نوع التجاوز

source: Select Cashier
ar: اختر كاشير

source: Logs Reports
ar: تقارير التجاوزات

# salesCostBasedStockCat
source: Sales Cost Based on Stock Category
ar: مجمل الأرباح حسب مجموعات البضاعة

# perc
source: Percentage
ar: النسبة

# profitPerc
source: Profit Percentage
ar: نسبة الربح

source: Profit
ar: مجمل الربح

source: Sales Cost
ar: قيمة المبيعات

# diffClosedCashByShifts
source: Total Cash Closing Differences By Cashier
ar: مجموع فروقات اغلاق الكاش حسب الكاشير

# diffCashByShifts
source: Shift Differences By Cashier
ar: فروقات الشفت حسب الكاشير

# numOfDiffTimes
source: Number of differences times
ar: عدد مرات وجود الفروقات

# valueOfTotalDiff
source: Value of Total differences
ar: قيمة مجموع الفروقات

source: Difference Value
ar: قيمة الفرق
